## Plan Result (prod-cftapps_cluster_lb_backend)




<pre><code>Plan: 0 to add, 3 to change, 0 to destroy.</code></pre>

* Update
  * module.app-gw.azurerm_application_gateway.ag[0]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[1]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.app-gw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.app-gw.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw"
        name                = "aks00-prod-agw"
        tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (4 unchanged attributes hidden)


      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/div-emca"
          ~ name         = "div-emca" -> "ia-bail-case-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/div-fps"
          ~ name         = "div-fps" -> "div-emca"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/div-dgs"
          ~ name         = "div-dgs" -> "div-fps"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/div-cms"
          ~ name         = "div-cms" -> "div-dgs"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/div-cos"
          ~ name         = "div-cos" -> "div-cms"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/div-hm"
          ~ name         = "div-hm" -> "div-cos"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/div-cfs"
          ~ name         = "div-cfs" -> "div-hm"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/finrem-ns"
          ~ name         = "finrem-ns" -> "div-cfs"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/finrem-ps"
          ~ name         = "finrem-ps" -> "finrem-ns"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/finrem-emca"
          ~ name         = "finrem-emca" -> "finrem-ps"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/finrem-dgcs"
          ~ name         = "finrem-dgcs" -> "finrem-emca"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/finrem-cos"
          ~ name         = "finrem-cos" -> "finrem-dgcs"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/em-anno"
          ~ name         = "em-anno" -> "finrem-cos"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/em-npa"
          ~ name         = "em-npa" -> "em-anno"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/em-stitching"
          ~ name         = "em-stitching" -> "em-npa"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/em-ccd-orchestrator"
          ~ name         = "em-ccd-orchestrator" -> "em-stitching"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/em-icp"
          ~ name         = "em-icp" -> "em-ccd-orchestrator"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/em-hrs-api"
          ~ name         = "em-hrs-api" -> "em-icp"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/em-hrs-ingestor"
          ~ name         = "em-hrs-ingestor" -> "em-hrs-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/dg-docassembly"
          ~ name         = "dg-docassembly" -> "em-hrs-ingestor"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/dm-store"
          ~ name         = "dm-store" -> "dg-docassembly"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/sscs-tribunals-api"
          ~ name         = "sscs-tribunals-api" -> "dm-store"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/sscs-evidence-share"
          ~ name         = "sscs-evidence-share" -> "sscs-tribunals-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/sscs-bulk-scan"
          ~ name         = "sscs-bulk-scan" -> "sscs-evidence-share"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/sscs-ccd-callback-orchestrator"
          ~ name         = "sscs-ccd-callback-orchestrator" -> "sscs-bulk-scan"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/sscs-tya-notif"
          ~ name         = "sscs-tya-notif" -> "sscs-ccd-callback-orchestrator"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/fpl-case-service"
          ~ name         = "fpl-case-service" -> "sscs-tya-notif"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/payment-api"
          ~ name         = "payment-api" -> "fpl-case-service"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/fees-register-api"
          ~ name         = "fees-register-api" -> "payment-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/ccpay-refunds-api"
          ~ name         = "ccpay-refunds-api" -> "fees-register-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/ethos-repl-docmosis-backend"
          ~ name         = "ethos-repl-docmosis-backend" -> "ccpay-refunds-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/ethos-ecm-consumer"
          ~ name         = "ethos-ecm-consumer" -> "ethos-repl-docmosis-backend"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/ccd-data-store-api"
          ~ name         = "ccd-data-store-api" -> "ethos-ecm-consumer"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/ccd-definition-store-api"
          ~ name         = "ccd-definition-store-api" -> "ccd-data-store-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/ccd-user-profile-api"
          ~ name         = "ccd-user-profile-api" -> "ccd-definition-store-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/ccd-case-print-service"
          ~ name         = "ccd-case-print-service" -> "ccd-user-profile-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/ccd-case-activity-api"
          ~ name         = "ccd-case-activity-api" -> "ccd-case-print-service"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/ccd-admin-web"
          ~ name         = "ccd-admin-web" -> "ccd-case-activity-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/ccd-message-publisher"
          ~ name         = "ccd-message-publisher" -> "ccd-admin-web"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/ccd-case-document-am-api"
          ~ name         = "ccd-case-document-am-api" -> "ccd-message-publisher"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/aac-manage-case-assignment"
          ~ name         = "aac-manage-case-assignment" -> "ccd-case-document-am-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/cpo-case-payment-orders-api"
          ~ name         = "cpo-case-payment-orders-api" -> "aac-manage-case-assignment"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/bar-api"
          ~ name         = "bar-api" -> "cpo-case-payment-orders-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/rd-professional-api"
          ~ name         = "rd-professional-api" -> "bar-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/rd-user-profile-api"
          ~ name         = "rd-user-profile-api" -> "rd-professional-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/rd-profile-sync"
          ~ name         = "rd-profile-sync" -> "rd-user-profile-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/rd-judicial-api"
          ~ name         = "rd-judicial-api" -> "rd-profile-sync"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/rd-location-ref-api"
          ~ name         = "rd-location-ref-api" -> "rd-judicial-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/rd-caseworker-ref-api"
          ~ name         = "rd-caseworker-ref-api" -> "rd-location-ref-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/rd-commondata-api"
          ~ name         = "rd-commondata-api" -> "rd-caseworker-ref-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/am-role-assignment-service"
          ~ name         = "am-role-assignment-service" -> "rd-commondata-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id          

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

      }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/wa-case-event-handler" -> null
          - backend_address_pool_name  = "wa-case-event-handler" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/wa-case-event-handler" -> null
          - backend_http_settings_name = "wa-case-event-handler" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/httpListeners/wa-case-event-handler" -> null
          - http_listener_name         = "wa-case-event-handler" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/requestRoutingRules/wa-case-event-handler" -> null
          - name                       = "wa-case-event-handler" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/wa-case-event-handler"
          + backend_address_pool_name  = "wa-case-event-handler"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/wa-case-event-handler"
          + backend_http_settings_name = "wa-case-event-handler"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/httpListeners/wa-case-event-handler"
          + http_listener_name         = "wa-case-event-handler"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/requestRoutingRules/wa-case-event-handler"
          + name                       = "wa-case-event-handler"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/wa-task-management-api" -> null
          - backend_address_pool_name  = "wa-task-management-api" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/wa-task-management-api" -> null
          - backend_http_settings_name = "wa-task-management-api" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/httpListeners/wa-task-management-api" -> null
          - http_listener_name         = "wa-task-management-api" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/requestRoutingRules/wa-task-management-api" -> null
          - name                       = "wa-task-management-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/wa-task-management-api"
          + backend_address_pool_name  = "wa-task-management-api"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/wa-task-management-api"
          + backend_http_settings_name = "wa-task-management-api"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/httpListeners/wa-task-management-api"
          + http_listener_name         = "wa-task-management-api"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/requestRoutingRules/wa-task-management-api"
          + name                       = "wa-task-management-api"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/wa-task-monitor" -> null
          - backend_address_pool_name  = "wa-task-monitor" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/wa-task-monitor" -> null
          - backend_http_settings_name = "wa-task-monitor" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/httpListeners/wa-task-monitor" -> null
          - http_listener_name         = "wa-task-monitor" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/requestRoutingRules/wa-task-monitor" -> null
          - name                       = "wa-task-monitor" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/wa-task-monitor"
          + backend_address_pool_name  = "wa-task-monitor"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/wa-task-monitor"
          + backend_http_settings_name = "wa-task-monitor"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/httpListeners/wa-task-monitor"
          + http_listener_name         = "wa-task-monitor"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/requestRoutingRules/wa-task-monitor"
          + name                       = "wa-task-monitor"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/wa-workflow-api" -> null
          - backend_address_pool_name  = "wa-workflow-api" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/wa-workflow-api" -> null
          - backend_http_settings_name = "wa-workflow-api" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/httpListeners/wa-workflow-api" -> null
          - http_listener_name         = "wa-workflow-api" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/requestRoutingRules/wa-workflow-api" -> null
          - name                       = "wa-workflow-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/wa-workflow-api"
          + backend_address_pool_name  = "wa-workflow-api"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/wa-workflow-api"
          + backend_http_settings_name = "wa-workflow-api"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/httpListeners/wa-workflow-api"
          + http_listener_name         = "wa-workflow-api"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/requestRoutingRules/wa-workflow-api"
          + name                       = "wa-workflow-api"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/xui-activity-tracker-api" -> null
          - backend_address_pool_name  = "xui-activity-tracker-api" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/xui-activity-tracker-api" -> null
          - backend_http_settings_name = "xui-activity-tracker-api" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/httpListeners/xui-activity-tracker-api" -> null
          - http_listener_name         = "xui-activity-tracker-api" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/requestRoutingRules/xui-activity-tracker-api" -> null
          - name                       = "xui-activity-tracker-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/xui-activity-tracker-api"
          + backend_address_pool_name  = "xui-activity-tracker-api"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/xui-activity-tracker-api"
          + backend_http_settings_name = "xui-activity-tracker-api"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/httpListeners/xui-activity-tracker-api"
          + http_listener_name         = "xui-activity-tracker-api"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/requestRoutingRules/xui-activity-tracker-api"
          + name                       = "xui-activity-tracker-api"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/xui-terms-and-conditions" -> null
          - backend_address_pool_name  = "xui-terms-and-conditions" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/xui-terms-and-conditions" -> null
          - backend_http_settings_name = "xui-terms-and-conditions" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/httpListeners/xui-terms-and-conditions" -> null
          - http_listener_name         = "xui-terms-and-conditions" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/requestRoutingRules/xui-terms-and-conditions" -> null
          - name                       = "xui-terms-and-conditions" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/xui-terms-and-conditions"
          + backend_address_pool_name  = "xui-terms-and-conditions"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/xui-terms-and-conditions"
          + backend_http_settings_name = "xui-terms-and-conditions"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/httpListeners/xui-terms-and-conditions"
          + http_listener_name         = "xui-terms-and-conditions"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/requestRoutingRules/xui-terms-and-conditions"
          + name                       = "xui-terms-and-conditions"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "ia-bail-case-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "ia-bail-case-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "ia-bail-case-api"
          + id                         = (known after apply)
          + name                       = "ia-bail-case-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }



        # (95 unchanged blocks hidden)
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[1] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.app-gw.azurerm_application_gateway.ag[1] has changed
  ~ resource "azurerm_application_gateway" "ag" {
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw"
        name                = "aks01-prod-agw"
        tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (4 unchanged attributes hidden)


      ~ backend_address_pool {
          + fqdns        = []
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendAddressPools/ts-translation-service"
            name         = "ts-translation-service"
            # (1 unchanged attribute hidden)
        }

      ~ backend_http_settings {
            id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/backendHttpSettingsCollection/ts-translation-service"
            name                                = "ts-translation-service"
          + trusted_root_certificate_names      = []
            # (7 unchanged attributes hidden)
        }




      ~ http_listener {
          + host_names                     = []
            id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/aks-infra-prod-rg/providers/Microsoft.Network/applicationGateways/aks01-prod-agw/httpListeners/ts-translation-service"
            name                           = "ts-translation-service"
            # (7 unchanged attributes hidden)
        }






        # (22 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":1221,"Program":"tfcmt","SHA1":"","Target":"prod-cftapps_cluster_lb_backend","Vars":{}} -->